/*
创建你线程的目的是开辟一条执行路径，去运行指定的代码和其他代码并行运行
JVM创建的主线程的任务都定义在主函数中。
而自定义的线程在哪呢？
Thread类用于描述线程，线程是需要任务的。所以Thread类也对任务的描述。
这个任务就通过Thread类中的run方法来体现，也就是说，run方法就是封装自定义线程任务的函数。

run方法中定义的就是线程要运行的任务代码。
所以只有继承Thread类，并重写run方法。

创建线程方式一：
1、定义一个类继承Thread类。
2、重写run方法。
*/

class Demo extends Thread{
    private String name;
	Demo(String name){
		//  可以给线程分配自定义名字，线程有缺省名字：Thread-编号，编号按开启顺序从0开始
		super("线程："+name);
		this.name = name;
	}

	public void show()throws Exception{		
		for (int i=1;i<=10 ;i++ ) {
			Thread.sleep(50);
		    //System.out.println("  ."+name+".  "+getName());	//	当前线程对象的名字
			System.out.println("  ."+name+".  "+Thread.currentThread().getName());		//	当前运行线程的名字
		}
	}
	/*
	public void start(){
		super.start();
	}
	*/
	public void run(){
		try {
		    show();
		}
		catch (Exception ex) {
			
		}
	}
}
class ThreadDemo 
{
	public static void main(String[] args) throws Exception
	{
		Demo d1 = new Demo("1");
		Demo d2 = new Demo("2");
		//	
		d1.start();
		d2.start();
		for (int i=0; i<10;i++ ) {
			Thread.sleep(50);
		    System.out.println("hello world!"+Thread.currentThread().getName());
		}
	}
}
/*
//	多次运行之后得到了不同的结果
E:\程序\JAVA程序>java ThreadDemo
  .1.  线程：1
  .2.  线程：2
  .1.  线程：1
  .2.  线程：2
  .1.  线程：1
  .2.  线程：2
  .1.  线程：1
  .2.  线程：2
  .1.  线程：1
  .2.  线程：2
  .1.  线程：1
  .2.  线程：2
  .1.  线程：1
  .2.  线程：2
  .1.  线程：1
  .2.  线程：2
  .1.  线程：1
  .2.  线程：2
  .1.  线程：1
  .2.  线程：2
 //////////////////////////////////////////////////////
E:\程序\JAVA程序>java ThreadDemo
22222.......0
22222.......1
22222.......2
22222.......3
22222.......4
22222.......5
22222.......6
22222.......7
22222.......8
11111.......0
11111.......1
11111.......2
11111.......3
11111.......4
11111.......5
11111.......6
11111.......7
11111.......8
11111.......9
22222.......9

E:\程序\JAVA程序>java ThreadDemo
22222.......0
22222.......1
22222.......2
22222.......3
22222.......4
22222.......5
22222.......6
22222.......7
22222.......8
22222.......9
11111.......0
11111.......1
11111.......2
11111.......3
11111.......4
11111.......5
11111.......6
11111.......7
11111.......8
11111.......9

E:\程序\JAVA程序>java ThreadDemo
22222.......0
22222.......1
22222.......2
22222.......3
22222.......4
22222.......5
22222.......6
22222.......7
22222.......8
22222.......9
11111.......0
11111.......1
11111.......2
11111.......3
11111.......4
11111.......5
11111.......6
11111.......7
11111.......8
11111.......9

E:\程序\JAVA程序>java ThreadDemo
11111.......0
11111.......1
11111.......2
11111.......3
11111.......4
11111.......5
11111.......6
22222.......0
22222.......1
22222.......2
22222.......3
22222.......4
22222.......5
22222.......6
22222.......7
22222.......8
22222.......9
11111.......7
11111.......8
11111.......9
*/